trwbox/micropython/ports/esp32/network_wlan.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * Development of the code in this file was sponsored by Microbric Pty Ltd
 * and Mnemote Pty Ltd
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2016, 2017 Nick Moore @mnemote
 * Copyright (c) 2017 "Eric Poulsen" <eric@zyxod.com>
 *
 * Based on esp8266/modnetwork.c which is Copyright (c) 2015 Paul Sokolovsky
 * And the ESP IDF example code which is Public Domain / CC0
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <string.h>

#include "py/objlist.h"
#include "py/runtime.h"
#include "py/mphal.h"
#include "extmod/modnetwork.h"
#include "modnetwork.h"

#include "esp_wifi.h"
#include "esp_log.h"
#include "esp_psram.h"

#ifndef NO_QSTR
#include "mdns.h"
#endif

#if MICROPY_PY_NETWORK_WLAN

#if (WIFI_MODE_STA & WIFI_MODE_AP != WIFI_MODE_NULL || WIFI_MODE_STA | WIFI_MODE_AP != WIFI_MODE_APSTA)
#error WIFI_MODE_STA and WIFI_MODE_AP are supposed to be bitfields!
#endif

typedef base_if_obj_t wlan_if_obj_t;

static wlan_if_obj_t wlan_sta_obj;
static wlan_if_obj_t wlan_ap_obj;

// Set to "true" if esp_wifi_start() was called
static bool wifi_started = false;

// Set to "true" if the STA interface is requested to be connected by the
// user, used for automatic reassociation.
static bool wifi_sta_connect_requested = false;

// Set to "true" if the STA interface is connected to wifi and has IP address.
static bool wifi_sta_connected = false;

// Store the current status. 0 means None here, safe to do so as first enum value is WIFI_REASON_UNSPECIFIED=1.
static uint8_t wifi_sta_disconn_reason = 0;

// Set to "true" if there is an in-progress background scan
static bool scan_in_progress = false;

/// TODO: These were garbage collected so they needed to be moved into root pointers. Normally they would then be accessed with
//  MP_STATE_PORT(variable_name). For some reason that isn't working, so I manually expanded the MP_STATE_PORT macro to mp_state_ctx.vm.variable_name

// A list to hold the remaining channels to scan
// static mp_obj_t remaining_channels;

// An array to hold the remaining channels for a multi-channel scan
static int *remaining_channels = NULL;
static int remaining_channels_len = -1;
static int remaining_channels_index = -1;

typedef struct wifi_ap_scan_record_t {
    // When gathering the results, this is a *wifi_ap_record_t, so I think we need a pointer to the pointer?
    // This will need freed after being used
    wifi_ap_record_t *wifi_ap_record;
    int wifi_ap_record_count;
    struct wifi_ap_scan_record_t* next_record;
} wifi_ap_scan_record_t;

// The singly linked list that will get used to fill out the scanned ap list after all the searches are done.
static wifi_ap_scan_record_t *scan_head = NULL;
static wifi_ap_scan_record_t *scan_tail = NULL;

// Tell the callback function that a de-init has happened, therefore discard the results of the scan
// Start with true, so it defaults to discarding
static bool soft_reboot_happened = false;

// // A list for the last scan results
// static mp_obj_t last_scan_aps;

// // A temporary list for storing the partial scan results between channel scans
// static mp_obj_t partial_scan_aps;

// The wifi scan config, so that the scan_done event can properly use it
static wifi_scan_config_t scanning_config;

#if MICROPY_HW_ENABLE_MDNS_QUERIES || MICROPY_HW_ENABLE_MDNS_RESPONDER
// Whether mDNS has been initialised or not
static bool mdns_initialised = false;
#endif

static uint8_t conf_wifi_sta_reconnects = 0;
static uint8_t wifi_sta_reconnects;

// Declare the function here for the scan_done_cb to work properly
static bool read_wifi_scan_results(void);

// This callback is scheduled by the WIFI_EVENT_SCAN_DONE, so that the execution happens outside of the system thread task, and has the micro-python context.
static mp_obj_t scan_done_cb(mp_obj_t arg){
    ESP_LOGI("wifi_blocking_mod", "Now inside of the scan_done_callback");
    // Save the new partial scan results to the list. This also frees the allocated memory from esp-idf
    if(!read_wifi_scan_results()){
        // If this returns false, then a soft reboot happened, and we need to clear out all the things
        ESP_LOGE("wifi_blocking_mod", "This was a scan that completed after a reset");
        while(scan_head != NULL){
            free(scan_head->wifi_ap_record);
            wifi_ap_scan_record_t *new_head = scan_head->next_record;
            scan_head = new_head;
        }
        free(remaining_channels);
        remaining_channels_len = -1;
        remaining_channels_index = -1;
        scan_in_progress = false;
        soft_reboot_happened = false;
        mp_state_ctx.vm.last_scan_aps = mp_const_none;

        ESP_LOGE("wifi_blocking_mod", "Done clearing the state from the previous scan completing, returning nothing");        
        return mp_const_none;
    }

    if (remaining_channels_len != -1){
        ESP_LOGI("wifi_blocking_mod", "There are more channels to scan");
        ESP_LOGD("wifi_blocking_mod", "There appears to be %d more channels that need scanned", (remaining_channels_len - remaining_channels_index));
        int next_channel = remaining_channels[remaining_channels_index];
        ESP_LOGI("wifi_blocking_mod", "Pulled off the channel %d from the list at index %d, incrementing index", next_channel, remaining_channels_index);
        // Move to the next index
        remaining_channels_index++;
        // If we reached the end of the list
        if (remaining_channels_index == remaining_channels_len){
            ESP_LOGI("wifi_blocking_mod", "Reached end of the remaining channels, clearing the array, len, and index");
            free(remaining_channels);
            remaining_channels = NULL;
            remaining_channels_len = -1;
            remaining_channels_index = -1;
        }
        ESP_LOGD("wifi_blocking_mod", "Setting the scanning_config to use this channel");
        scanning_config.channel = next_channel;
        ESP_LOGI("wifi_blocking_mod", "Starting the scan on the new channel");
        MP_THREAD_GIL_EXIT();
        // Don't block even if the original was blocking because that is doing busy wait
        esp_err_t status = esp_wifi_scan_start(&scanning_config, 0);
        MP_THREAD_GIL_ENTER();
        esp_exceptions(status);
    // If there are no more channels to scan read out the scan results into a new list and clear the set flag
    } else {
        // Allocate a whole new list
        mp_obj_t list = mp_obj_new_list(0, NULL);
        // Go through the whole results list, parsing the results into a 
        while(scan_head != NULL){
            ESP_LOGI("wifi_blocking_mod", "Starting loading a new set of ap records into a new list");
            for (uint16_t i = 0; i < scan_head->wifi_ap_record_count; i++){
                mp_obj_tuple_t *t = mp_obj_new_tuple(6, NULL);
                uint8_t *x = memchr(scan_head->wifi_ap_record[i].ssid, 0, sizeof(scan_head->wifi_ap_record[i].ssid));
                int ssid_len = x ? x - scan_head->wifi_ap_record[i].ssid : sizeof(scan_head->wifi_ap_record[i].ssid);
                t->items[0] = mp_obj_new_bytes(scan_head->wifi_ap_record[i].ssid, ssid_len);
                t->items[1] = mp_obj_new_bytes(scan_head->wifi_ap_record[i].bssid, sizeof(scan_head->wifi_ap_record[i].bssid));
                t->items[2] = MP_OBJ_NEW_SMALL_INT(scan_head->wifi_ap_record[i].primary);
                t->items[3] = MP_OBJ_NEW_SMALL_INT(scan_head->wifi_ap_record[i].rssi);
                t->items[4] = MP_OBJ_NEW_SMALL_INT(scan_head->wifi_ap_record[i].authmode);
                /// TODO: Get the hidden value correctly
                t->items[5] = mp_const_false; // XXX hidden?
                mp_obj_list_append(list, MP_OBJ_FROM_PTR(t));
            }
            // Free the record memory
            ESP_LOGI("wifi_blocking_mod", "Freeing the allocated space for the head of the scan_list");
            free(scan_head->wifi_ap_record);
            ESP_LOGI("wifi_blocking_mod", "Getting the next item in the list, and freeing the record");
            wifi_ap_scan_record_t *new_head = scan_head->next_record;
            free(scan_head);
            scan_head = new_head;
        }
        ESP_LOGI("wifi_blocking_mod", "All the records were read into the list, setting global and clearing flag");
        mp_state_ctx.vm.last_scan_aps = list;
        scan_in_progress = false;
    }
    return mp_const_none;
    // ESP_LOGI("wifi_blocking_mod", "Got the latest scan results");
    // See if there are any more channels that need to be scanned
    // ESP_LOGE("wifi_blocking_mod", "checking if the remaining lists is an object");
    // if(!mp_obj_is_obj(mp_state_ctx.vm.remaining_channels)){
    //     ESP_LOGE("wifi_blocking_mod", "The remaining_channels was not a real micropython object, recreating a new empty list");
    //     mp_state_ctx.vm.remaining_channels = mp_obj_new_list(0, NULL);
    // } else {
    //     ESP_LOGE("wifi_blocking_mod", "The remaining_channels was an object?");
    //     ESP_LOGE("wifi_blocking_mod", "Type %s", mp_obj_get_type_str(mp_state_ctx.vm.remaining_channels));
    // }
    // ESP_LOGI("wifi_blocking_mod", "Getting the length of the remaining_channels");
    // int channel_count = mp_obj_get_int(mp_obj_len(mp_state_ctx.vm.remaining_channels));
    // ESP_LOGI("wifi_blocking_mod", "The length value is %d", channel_count);
    // if (channel_count > 0){
    //     ESP_LOGI("wifi_blocking_mod", "There are still channels that need scanning!");
    //     // If we are here, it is safe to assume at least 1 item in the list
    //     mp_obj_t *channels;
    //     unsigned int channels_len;
    //     ESP_LOGI("wifi_blocking_mod", "Getting the next channel from the remaining_channels list");
    //     mp_obj_get_array(mp_state_ctx.vm.remaining_channels, &channels_len, &channels);
    //     if (channels_len == 0){
    // //         mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("Something wrong here?"));
    // //     }
    //     ESP_LOGI("wifi_blocking_mod", "Setting the configuration to have channel %ld", mp_obj_get_int(channels[0]));
    //     scanning_config.channel = mp_obj_get_int(channels[0]);
    //     ESP_LOGI("wifi_blocking_mod", "Removing the channel from remaining_channels");
    //     mp_obj_list_remove(mp_state_ctx.vm.remaining_channels, channels[0]);
    //     ESP_LOGI("wifi_blocking_mod", "Starting the scan on the new channel");
    //     MP_THREAD_GIL_EXIT();
    //     // Don't block even if the original was blocking because that is doing busy wait
    //     esp_err_t status = esp_wifi_scan_start(&scanning_config, 0);
    //     MP_THREAD_GIL_ENTER();
    // //     esp_exceptions(status);
    // } else {
    //     ESP_LOGI("wifi_blocking_mod", "There are no channels that need scanning, so we are done");
    //     ESP_LOGI("wifi_blocking_mod", "Setting the last_scan_aps to the partial_scan_aps");
    //     mp_state_ctx.vm.last_scan_aps = mp_state_ctx.vm.partial_scan_aps;
    //     ESP_LOGI("wifi_blocking_mod", "Clearing the scan_in_progress flag");
    //     scan_in_progress = false;
    //     // TODO: If there was a callback, and this was a background scan, make the call to the callback function
    // }
    // return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_scan_done_cb_obj, scan_done_cb);

