trwbox/micropython/ports/esp32/network_wlan.c
static void require_if(mp_obj_t wlan_if, int if_no) {
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(wlan_if);
    if (self->if_id != if_no) {
        mp_raise_msg(&mp_type_OSError, if_no == ESP_IF_WIFI_STA ? MP_ERROR_TEXT("STA required") : MP_ERROR_TEXT("AP required"));
    }
}

void esp_initialise_wifi(void) {
    static int wifi_initialized = 0;
    /// TODO: This is extraordinary scuffed? Like ultra not how this is supposed to work.
    // The micropython soft reset clears all of the python VMs variables.
    // This leads to the global references for the following variables to be pointing at uninitialized memory.
    // This memory can and repeatedly does "appear" like a valid python object, and even a valid list sometimes.
    // Therefore it cannot just be simply checked as far as I can tell. While the python VM has it's state cleared, 
    // the global variables for this code are not cleared IE the variable `wifi_initalized`. Therefore, on the new
    // running of the main loop, a wifi initialization occurs, but does nothing as the wifi_initialized is already true.
    // This would cause creating these values inside of the if statement to break, leaving un initialized memory.
    // This is a jank quick fix that anytime `network.WLAN()` is called, it will re-init these variables. If this method
    // is called more than once it WILL cause some weirdness around a multi-channel scan. Specifically, it will likely cause 
    // the scan to stop right away as there are no longer new channels to scan, clear the partially saved APs, and reset
    // the aps seen in the last scan. I have no clue how to handle this properly at 1AM, so 🤷‍♀️.
    // In other places there is deinit_all, that handles something around a soft reboot. I do not entirely understand what
    // those pieces of code are doing, and how it actually makes it work correctly around having the global python objects
    // deleted without. My best guess is that once the variables are set it turns a global flag like `wifi_initalized` to false
    // triggering the re-creation of the variables on the next init process, where that same flag gets set to true causing
    // further inits to not re-create those.
    //      Is a proper fix for this, changing the code to use C arrays, and/or linked lists? IE the remaining channels
    //          becomes an array of the channels required, a length variable, and the index in the array. This shouldn't
    //          cause the value to be cleared on soft reboot. This partial_scan_aps would likely need to become a linked list
    //          where you store each wifi value in a newly malloc'd value since large blocks storing all of the results at 
    //          once for each of the up to 14 scans could results in allocation issues.
    //          last_aps_seen could probably still be a normal python list that is created, and has tuples appended after all
    //          the scan results are completed, which clears each of the items in the linked list as it empties them.
    // ESP_LOGE("mod_blocking", "esp_initialise_wifi was called");
    // // Create the remaining channels list
    // mp_state_ctx.vm.remaining_channels = mp_obj_new_list(0, NULL);
    // ESP_LOGE("mod_blocking", "Allocated the remaining_channels as an empty list");
    // // Create a list for the partial scan
    // mp_state_ctx.vm.partial_scan_aps = mp_obj_new_list(0, NULL);
    // ESP_LOGE("mod_blocking", "Allocated the partial_scan_aps as an emtpy list");
    // Allocate that there are no aps in the last scan
    /// TODO: I don't like this always clearing. IE if you did a scan, and ran network.WLAN() it will cause it to be reset to None when it shouldn't need to be.
    mp_state_ctx.vm.last_scan_aps = mp_const_none;
    ESP_LOGE("mod_blocking", "Allocated the last_scan_aps as a None object");
    if (!wifi_initialized) {
        esp_exceptions(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, network_wlan_wifi_event_handler, NULL, NULL));
        esp_exceptions(esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID, network_wlan_ip_event_handler, NULL, NULL));

        wlan_sta_obj.base.type = &esp_network_wlan_type;
        wlan_sta_obj.if_id = ESP_IF_WIFI_STA;
        wlan_sta_obj.netif = esp_netif_create_default_wifi_sta();
        wlan_sta_obj.active = false;

        wlan_ap_obj.base.type = &esp_network_wlan_type;
        wlan_ap_obj.if_id = ESP_IF_WIFI_AP;
        wlan_ap_obj.netif = esp_netif_create_default_wifi_ap();
        wlan_ap_obj.active = false;

        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        #if CONFIG_SPIRAM_IGNORE_NOTFOUND
        if (!esp_psram_is_initialized()) {
            // If PSRAM failed to initialize, disable "Wi-Fi Cache TX Buffers"
            // (default SPIRAM config ESP32_WIFI_CACHE_TX_BUFFER_NUM==32, this is 54,400 bytes of heap)
            cfg.cache_tx_buf_num = 0;
            cfg.feature_caps &= ~CONFIG_FEATURE_CACHE_TX_BUF_BIT;

            // Set some other options back to the non-SPIRAM default values
            // to save more RAM.
            //
            // These can be determined from ESP-IDF components/esp_wifi/Kconfig and the
            // WIFI_INIT_CONFIG_DEFAULT macro
            cfg.tx_buf_type = 1; // Dynamic, this "magic number" is defined in IDF KConfig
            cfg.static_tx_buf_num = 0; // Probably don't need, due to tx_buf_type
            cfg.dynamic_tx_buf_num = 32; // ESP-IDF default value (maximum)
        }
        #endif
        ESP_LOGD("modnetwork", "Initializing WiFi");
        esp_exceptions(esp_wifi_init(&cfg));
        esp_exceptions(esp_wifi_set_storage(WIFI_STORAGE_RAM));

        ESP_LOGD("modnetwork", "Initialized");
        wifi_initialized = 1;
    }
}

static mp_obj_t network_wlan_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 0, 1, false);

    esp_initialise_wifi();

    int idx = (n_args > 0) ? mp_obj_get_int(args[0]) : ESP_IF_WIFI_STA;
    if (idx == ESP_IF_WIFI_STA) {
        return MP_OBJ_FROM_PTR(&wlan_sta_obj);
    } else if (idx == ESP_IF_WIFI_AP) {
        return MP_OBJ_FROM_PTR(&wlan_ap_obj);
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid WLAN interface identifier"));
    }
}

