trwbox/micropython/ports/esp32/network_wlan.c
static mp_obj_t network_wlan_scan(mp_obj_t self_in) {
    // check that STA mode is active
    wifi_mode_t mode;
    esp_exceptions(esp_wifi_get_mode(&mode));
    if ((mode & WIFI_MODE_STA) == 0) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("STA must be active"));
    }

    mp_obj_t list = mp_obj_new_list(0, NULL);
    wifi_scan_config_t config = { 0 };
    MP_THREAD_GIL_EXIT();
    esp_err_t status = esp_wifi_scan_start(&config, 1);
    MP_THREAD_GIL_ENTER();
    if (status == 0) {
        uint16_t count = 0;
        esp_exceptions(esp_wifi_scan_get_ap_num(&count));
        if (count == 0) {
            // esp_wifi_scan_get_ap_records must be called to free internal buffers from the scan.
            // But it returns an error if wifi_ap_records==NULL.  So allocate at least 1 AP entry.
            // esp_wifi_scan_get_ap_records will then return the actual number of APs in count.
            count = 1;
        }
        wifi_ap_record_t *wifi_ap_records = calloc(count, sizeof(wifi_ap_record_t));
        esp_exceptions(esp_wifi_scan_get_ap_records(&count, wifi_ap_records));
        for (uint16_t i = 0; i < count; i++) {
            mp_obj_tuple_t *t = mp_obj_new_tuple(6, NULL);
            uint8_t *x = memchr(wifi_ap_records[i].ssid, 0, sizeof(wifi_ap_records[i].ssid));
            int ssid_len = x ? x - wifi_ap_records[i].ssid : sizeof(wifi_ap_records[i].ssid);
            t->items[0] = mp_obj_new_bytes(wifi_ap_records[i].ssid, ssid_len);
            t->items[1] = mp_obj_new_bytes(wifi_ap_records[i].bssid, sizeof(wifi_ap_records[i].bssid));
            t->items[2] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].primary);
            t->items[3] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].rssi);
            t->items[4] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].authmode);
            t->items[5] = mp_const_false; // XXX hidden?
            mp_obj_list_append(list, MP_OBJ_FROM_PTR(t));
        }
        free(wifi_ap_records);
    }
    return list;
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_scan_obj, network_wlan_scan);

// This will read the partial_scan_results and return true if the results were saved in the list
static bool read_wifi_scan_results(){
    ESP_LOGD("wifi_blocking_mod", "Reading the wifi scan's results");
    ESP_LOGD("wifi_blocking_mod", "Getting the number of aps to account for");
    uint16_t count = 0;
    esp_exceptions(esp_wifi_scan_get_ap_num(&count));
    if (count == 0) {
        // esp_wifi_scan_get_ap_records must be called to free internal buffers from the scan.
        // But it returns an error if wifi_ap_records==NULL.  So allocate at least 1 AP entry.
        // esp_wifi_scan_get_ap_records will then return the actual number of APs in count.
        count = 1;
    }
    ESP_LOGD("wifi_blocking_mod", "Allocating the space for %d aps", count);
    wifi_ap_record_t *wifi_ap_records = calloc(count, sizeof(wifi_ap_record_t));
    ESP_LOGD("wifi_blocking_mod", "Getting the records for the aps");
    esp_exceptions(esp_wifi_scan_get_ap_records(&count, wifi_ap_records));
    // If there was a soft_reboot before the last init, then discard the results with no return
    if(soft_reboot_happened){
        ESP_LOGD("wifi_blocking_mod", "There has been a soft reboot since the scan started, discarding results");
        free(wifi_ap_records);
        return false;
    }
    // Otherwise create a new record item
    wifi_ap_scan_record_t *new_record = calloc(1, sizeof(wifi_ap_scan_record_t));
    // Set the array pointer and the next_record
    new_record->wifi_ap_record = wifi_ap_records;
    new_record->wifi_ap_record_count = count;
    new_record->next_record = NULL;
    // If there is no list yet start it
    if(scan_head == NULL){
        scan_head = new_record;
        scan_tail = new_record;
    // The list is already started
    } else {
        // Then update the current tail's next, and update the tail
        scan_tail->next_record = new_record;
        scan_tail = new_record;
    }
    return true;

    // // TODO: Check if the partial_scan_aps exists
    // // Create a new list to store the networks
    // ESP_LOGI("wifi_blocking_mod", "Getting the number of aps to account for");
    // uint16_t count = 0;
    // esp_exceptions(esp_wifi_scan_get_ap_num(&count));
    // if (count == 0) {
    //     // esp_wifi_scan_get_ap_records must be called to free internal buffers from the scan.
    //     // But it returns an error if wifi_ap_records==NULL.  So allocate at least 1 AP entry.
    //     // esp_wifi_scan_get_ap_records will then return the actual number of APs in count.
    //     count = 1;
    // }
    // ESP_LOGI("wifi_blocking_mod", "Allocating the space for %d aps", count);
    // wifi_ap_record_t *wifi_ap_records = calloc(count, sizeof(wifi_ap_record_t));
    // ESP_LOGI("wifi_blocking_mod", "Getting the records for the aps");
    // esp_exceptions(esp_wifi_scan_get_ap_records(&count, wifi_ap_records));
    // ESP_LOGI("wifi_blocking_mod", "Starting iterations");
    // for (uint16_t i = 0; i < count; i++) {
    //     // Uncomment all these lines for more verbose of what is going on in here
    //     // ESP_LOGE("wifi_blocking_mod", "Iteration %d trying tuple creation", i);
    //     mp_obj_tuple_t *t = mp_obj_new_tuple(6, NULL);
    //     // ESP_LOGE("wifi_blocking_mod", "Iteration %d trying memchr", i);
    //     uint8_t *x = memchr(wifi_ap_records[i].ssid, 0, sizeof(wifi_ap_records[i].ssid));
    //     int ssid_len = x ? x - wifi_ap_records[i].ssid : sizeof(wifi_ap_records[i].ssid);
    //     // ESP_LOGE("wifi_blocking_mod", "Iteration %d trying ssid_len", i);
    //     t->items[0] = mp_obj_new_bytes(wifi_ap_records[i].ssid, ssid_len);
    //     // ESP_LOGE("wifi_blocking_mod", "Iteration %d trying bssid", i);
    //     t->items[1] = mp_obj_new_bytes(wifi_ap_records[i].bssid, sizeof(wifi_ap_records[i].bssid));
    //     t->items[2] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].primary);
    //     // ESP_LOGE("wifi_blocking_mod", "Iteration %d trying primary", i);
    //     t->items[3] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].rssi);
    //     // ESP_LOGE("wifi_blocking_mod", "Iteration %d trying authmod", i);
    //     t->items[4] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].authmode);
    //     t->items[5] = mp_const_false; // XXX hidden?
    //     // ESP_LOGE("wifi_blocking_mod", "Iteration %d trying append", i);
    //     mp_obj_list_append(mp_state_ctx.vm.partial_scan_aps, MP_OBJ_FROM_PTR(t));
    // }
    // ESP_LOGI("wifi_blocking_mod", "freed the records");
    // free(wifi_ap_records);
}

// Get the last results and return them.
/// TODO: Should this return None when there is a scan currently in progress?
/// TODO: Make this a property instead of a function
static mp_obj_t network_wlan_results(mp_obj_t self_in){
    if (mp_state_ctx.vm.last_scan_aps == mp_const_none){
        ESP_LOGI("wifi_blocking_mod", "There has been no scan, therefore the returned value is None");
    } else {
        ESP_LOGI("wifi_blocking_mod", "There has been a scan, which had %ld results", mp_obj_get_int(mp_obj_len(mp_state_ctx.vm.last_scan_aps)));
    }
    return mp_state_ctx.vm.last_scan_aps;
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_results_obj, network_wlan_results);

