trwbox/micropython/ports/esp32/network_wlan.c
/// TODO: Make this a property instead of a function
static mp_obj_t network_wlan_in_progress(mp_obj_t self_in){
    return mp_obj_new_bool(scan_in_progress);
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_in_progress_obj, network_wlan_in_progress);

// This is called from the Ctrl-D soft reboot
void network_wlan_deinit_all(void){
    if(scan_in_progress){
        ESP_LOGI("wifi_blocking_mod", "soft reboot is happening, while a scan is going on, setting the flag to ignore scan callback");
        soft_reboot_happened = true;
    }
}

/* Some basic test python code
# This will setup the networking, and also enable the verbose debug logging
import esp; esp.osdebug(esp.LOG_VERBOSE); import network; nic = network.WLAN(network.STA_IF); nic.active(True);

import esp; esp.osdebug(esp.LOG_INFO); import network; nic = network.WLAN(network.STA_IF); nic.active(True);
import esp; esp.osdebug(esp.LOG_DEBUG); import network; nic = network.WLAN(network.STA_IF); nic.active(True);


# Without verbose logging
import network; nic = network.WLAN(network.STA_IF); nic.active(True);

# Single Channel Scan
nic.scan_non_blocking(channel=3)

# Multi channel scan
nic.scan_non_blocking(channel=[2, 3, 9])

nic.scan_non_blocking(channel=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]])

# Large min scan time, and print the progress state when done to show it's blocking
nic.scan_non_blocking(channel=3, scan_time_active_min=2000, scan_time_active_max=4000); print(nic.in_progress())

# Same thing, but with non-blocking
nic.scan_non_blocking(channel=3, scan_time_active_min=2000, scan_time_active_max=4000, blocking=False); print(nic.in_progress())

# Scan a couple channels and see the time it takes to when the in_progress changes back to false
def scan_wifi():
    import time
    nic.scan_non_blocking(channel=[2, 3], scan_time_active_min=2000, scan_time_active_max=4000, blocking=False)
    print("We have moved on from that code, and in_progress is: " + str(nic.in_progress()))
    start = time.time_ns()
    while (nic.in_progress()):
        pass
    end = time.time_ns()
    print("Total time: " + str((end - start) / 1000000000.0) + " seconds")

import esp; esp.osdebug(esp.LOG_INFO); import network; nic = network.WLAN(network.STA_IF); nic.active(True);
count = 0
while True:
    print("Iteration: " + str(count))
    nic.scan_non_blocking()
    count = count + 1

# See if the garbage collector is cleaning everything up
def garbage_check():
    import gc
    gc.collect()
    starting_mem = gc.mem_free()
    nic.scan_non_blocking()
    ending_mem = gc.mem_free()
    gc.collect()
    cleaned = gc.mem_free()
    print("starting: " + str(starting_mem) + " ending: " + str(ending_mem) + " cleaned: " + str(cleaned))
    print("overall difference: " + str(starting_mem - cleaned) + " bytes")

import esp; esp.osdebug(esp.LOG_INFO); 

import network; nic = network.WLAN(network.STA_IF); nic.active(True);
# Do it in a loop to try for a memory leak to show up
def garbage_loop(num_loops: int = 100, channel=0):
    import gc
    starting_mem = gc.mem_free()
    for i in range(num_loops):
        loop_start= gc.mem_free()
        nic.scan_non_blocking(channel=channel)
        gc.collect()
        loop_end = gc.mem_free()
        print("Loop interation " + str(i) + " mem changed: " + str(loop_start - loop_end))
    ending_mem = gc.mem_free()
    gc.collect()
    cleaned = gc.mem_free()
    print("starting: " + str(starting_mem) + " ending: " + str(ending_mem) + " cleaned: " + str(cleaned))
    print("overall difference: " + str(starting_mem - cleaned) + " bytes")

Loop testing
>>> micropython.mem_info()
stack: 704 out of 15360
GC: total: 56000, used: 5216, free: 50784, max new split: 102400
 No. of 1-blocks: 64, 2-blocks: 14, max blk sz: 40, max free sz: 3102
>>> garbage_loop(num_loops=1000, channel=[1,2,3,4,5,6,7,8,9,10,11,12,13,14])


Broke?

import network.
self.wlan.scan_non_blocking(blocking=False)
#await uasyncio.sleep_ms(10)
while self.wlan.in_progress():
    await uasyncio.sleep_ms(200)
    continue
nets = self.wlan.results()


import esp;
esp.osdebug(esp.LOG_DEBUG);
import network;
nic = network.WLAN(network.STA_IF);
nic.active(True);
*/

static mp_obj_t network_wlan_non_blocking_scan(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_blocking, ARG_channel, ARG_ssid, ARG_bssid, ARG_show_hidden, ARG_active_scan,
           ARG_scan_time_passive, ARG_scan_time_active_min, ARG_scan_time_active_max, 
           ARG_home_chan_dwell_time, ARG_callback
        };
    static const mp_arg_t allowed_args[] = {
        // Create the list of optional elements that can be given, starting with the self object that
        // will always exist 
        { MP_QSTR_self, MP_ARG_REQUIRED | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // If the scan should be sent to the blocking
        { MP_QSTR_blocking, MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = true }},
        // The channel, or list of channels that should be scanned
        { MP_QSTR_channel, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // The ssid string that should be scanned for, default of None
        { MP_QSTR_ssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // The mac address bssid that should be scanned for, default is None
        /// TODO: Should this be allowed as bytes, a string or both?
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }},
        // If hidden networks should be shown, default of false
        { MP_QSTR_show_hidden, MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = false }},
        // If the scan should be active with WIFI_SCAN_TYPE_ACTIVE
        { MP_QSTR_active_scan, MP_ARG_KW_ONLY | MP_ARG_BOOL, { .u_bool = true }},
        // Time to passive scan, default 360 ms
        { MP_QSTR_scan_time_passive, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 360 }},
        // Min time to spend actively scanning, default of 0 ms
        { MP_QSTR_scan_time_active_min, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 0 }},
        // Max time to spend actively scanning, default of 120 ms
        { MP_QSTR_scan_time_active_max, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 120 }},
        // Time to spend on the home channel between hops if connected to a wifi network to not lose connection, defaults to 30ms
        { MP_QSTR_home_chan_dwell_time, MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 30 }},
        // Callback function that will be called with the results from the scan after the non-blocking scan has completed
        { MP_QSTR_callback, MP_ARG_KW_ONLY | MP_ARG_OBJ, { .u_obj = mp_const_none }}
    };

    // Get the args to the function based on the keywords
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Raise an error if the scan is already happening
    if (scan_in_progress) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("Scan is already running, cannot start another scan"));
    }

    // ESP_LOGE("wifi_blocking_mod", "checking if the remaining lists is an object in scan");
    // if(!mp_obj_is_obj(mp_state_ctx.vm.remaining_channels)){
    //     ESP_LOGE("wifi_blocking_mod", "The remaining_channels was not a real micropython object, recreating a new empty list");
    //     mp_state_ctx.vm.remaining_channels = mp_obj_new_list(0, NULL);
    // } else {
    //     ESP_LOGE("wifi_blocking_mod", "The remaining_channels was an object?");
    //     ESP_LOGE("wifi_blocking_mod", "Type %s", mp_obj_get_type_str(mp_state_ctx.vm.remaining_channels));
    // }

    // check that STA mode is active
    wifi_mode_t mode;
    esp_exceptions(esp_wifi_get_mode(&mode));
    if ((mode & WIFI_MODE_STA) == 0) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("STA must be active"));
    }

