trwbox/micropython/ports/esp32/network_wlan.c
    // Setup some variables
    // Should the scan be blocking
    bool blocking = false;
    /// The channel to scan for a single
    int scan_channel = 0;
    // If there is a list to scan
    bool scan_list = false;

    /// TODO: Check that blocking is valid. I don't think it should ever not be with MP_ARG_BOOL, but unsure
    blocking = args[ARG_blocking].u_bool;

    // Check that the channels are properly typed
    // If the object is an integer, then it's a single channel scan
    if (mp_obj_is_int(args[ARG_channel].u_obj)){
        int chan = mp_obj_get_int(args[ARG_channel].u_obj);
        ESP_LOGD("wifi_blocking_mod", "Got a single channel %d", chan);
        if (chan > 14 || chan < 0){
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("Bad channel value, expecting 1-14"));
        }
        scan_channel = chan;
        /// TODO: Should this force the remaining_channels list to 0 items?
    // Check if the object is a list or tuple
    } else if (mp_obj_is_type(args[ARG_channel].u_obj, &mp_type_list) || mp_obj_is_type(args[ARG_channel].u_obj, &mp_type_tuple)){
        ESP_LOGI("wifi_blocking_mod", "Got a list of channels to scan");
        mp_obj_t channel_list = args[ARG_channel].u_obj;
        int channel_count = mp_obj_get_int(mp_obj_len(channel_list));
        // Check if there are more channels than possible
        if (channel_count > 14) {
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("More channels supplied than were possible to scan"));
        // There were no channels given, but there was an array
        } else if(channel_count == 0){
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("An array with no channels to scan is invalid"));
        }

        // Get the list of items from the array
        mp_obj_t *items;
        mp_obj_get_array_fixed_n(channel_list, channel_count, &items);
        // Check all the channels themselves for proper values
        for(int i = 0; i < channel_count; i++) {
            // Check that object is an int first
            if (!mp_obj_is_int(items[i])) {
                mp_raise_msg(&mp_type_TypeError, MP_ERROR_TEXT("The channels need to be specified as integers"));
            }
            // Check that it is a valid channel
            int temp_channel_number = mp_obj_get_int(items[i]);
            if (temp_channel_number > 14 || temp_channel_number < 1){
                mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("Unsupported channel values in channel list"));
            }
            /// TODO: Check for duplicate channels
        }
        // Set the scan_list flag
        scan_list = true;
        // Set the channel to start this scan on
        scan_channel = mp_obj_get_int(items[0]);
        ESP_LOGD("wifi_blocking_mod", "Allocating space for the remaining channels");
        // Allocate an array for the channels that remain to be scanned
        int* new_channels = calloc(channel_count-1, sizeof(int));
        // Start the indexing at 1 since the first channel will be started in this method
        for(int i = 1; i < channel_count; i++){
            int channel = mp_obj_get_int(items[i]);
            ESP_LOGI("wifi_blocking_mod", "Adding channel %d to the list of channels to scan", channel);
            // Append the channel to the list
            new_channels[i-1] = channel;
        }
        if(remaining_channels != NULL){
            ESP_LOGE("wifi_blocking_mod", "There was another attempt to replace the remaining_channels array while it wasn't NULL");
        }
        ESP_LOGD("wifi_blocking_mod", "Setting the remaining_channels array");
        // Set the remaining_channels array and length and index
        remaining_channels = new_channels;
        remaining_channels_len = channel_count - 1;
        remaining_channels_index = 0;
        // // Set the remaining channel list to have these saved
        // remaining_channels = list;
    // If there was nothing given assume 0 for scan all
    } else if (args[ARG_channel].u_obj == mp_const_none) {
        ESP_LOGI("wifi_blocking_mod", "No channels given, scanning all of them");
    } else {
        mp_raise_msg(&mp_type_TypeError, MP_ERROR_TEXT("Channel was invalidly typed"));
    }

    // Check if the ssid exists
    /// TODO: Check that the ssid is valid name for a network
    if (!(args[ARG_ssid].u_obj == mp_const_none) && !mp_obj_is_str(args[ARG_ssid].u_obj)){
        mp_raise_msg(&mp_type_TypeError, MP_ERROR_TEXT("Bad typing on ssid, expected a string"));
    } else {
        ESP_LOGI("wifi_blocking_mod", "There was no ssid");
    }

    // Check if the bssid exists
    /// TODO: Check that the bssid is a valid mac address
    if (!(args[ARG_bssid].u_obj == mp_const_none) && !(mp_obj_is_type(args[ARG_bssid].u_obj, &mp_type_bytes))){
        mp_raise_msg(&mp_type_TypeError, MP_ERROR_TEXT("Bad typing on bssid, expected a string"));
    } else {
        ESP_LOGI("wifi_blocking_mod", "There was no bssid");
    }

    /// TODO: Check that show_hidden is valid
    /// TODO: Check that active_scan is valid
    /// TODO: Check that scan_time_passive is valid
    /// TODO: Check that scan_time_active_max is valid
    /// TODO: Check that scan_time_active_min is valid
    /// TODO: Check that home_dwell_time is valid
    // I think these should always all be valid since they are typed args, but unsure

    /// TODO: Implement having a python callback like this pull request https://github.com/micropython/micropython/pull/7526/files

    // Check if we should blocking, and that a callback exists
    if (args[ARG_callback].u_obj == mp_const_none && args[ARG_blocking].u_bool) {
        ESP_LOGI("wifi_blocking_mod", "Blocking is true, but there is no callback specified");
    // If there is a callback, but the scan wasn't for the blocking raise an error    
    } else if (args[ARG_callback].u_obj != mp_const_none && !args[ARG_blocking].u_bool) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("The callback should only be set if a blocking scan is happening"));
    } else if (args[ARG_callback].u_obj != mp_const_none && mp_obj_is_callable(args[ARG_callback].u_obj)){
        ESP_LOGI("wifi_blocking_mod", "There is a callback for the blocking scan");
    }

    ESP_LOGI("wifi_blocking_mod", "creating the esp wifi config");
    // Create the temporary null configuration
    wifi_scan_config_t config = { 0 };
    // Copy that null configuration into the global configuration
    memcpy(&scanning_config, &config, sizeof(wifi_scan_config_t));
    // The wifi_scan_config_t has the fields
    // ssid as *uint8
    // bssid as *uint8
    // channel as int for the channel to scan with default of 0 for all
    // show_hidden as boolean for showing hidden networks
    // scan_type as enum, with WIFI_SCAN_TYPE_ACTIVE being the default
    // scan_time which is another struct
    //      scan_time.active.min is the minimum time to spend on a channel looking for APs
    //      scan_time.active.max is the maximum time to spend on a channel looking for APs
    //      scan_time.passive is the time to spend on a channel in a passive scan. Channels 13 and 14 are always passive scans
    // home_chan_dwell_time is the time to jump back to the connected wifi's channel to remain connected

    /// TODO: Read the ssid from the variable and place it into the correct location of the struct

    /// TODO: Take the bssid, and place it into the correct location in the struct
    
    ESP_LOGI("wifi_blocking_mod", "Setting the config channel to %d", scan_channel);
    scanning_config.channel = scan_channel;
    ESP_LOGI("wifi_blocking_mod", "Setting the config show_hidden to %d", args[ARG_show_hidden].u_bool);
    scanning_config.show_hidden = args[ARG_show_hidden].u_bool;
    if (args[ARG_active_scan].u_bool){
        ESP_LOGD("wifi_blocking_mod", "We are using an active type scan!");
        scanning_config.scan_type = WIFI_SCAN_TYPE_ACTIVE;
    } else {
        ESP_LOGI("wifi_blocking_mod", "We are not using an active scan type");
        scanning_config.scan_type = WIFI_SCAN_TYPE_PASSIVE;
    }
    ESP_LOGI("wifi_blocking_mod", "Setting the config active max to %ld", args[ARG_scan_time_active_max].u_int);
    scanning_config.scan_time.active.max = args[ARG_scan_time_active_max].u_int;
    ESP_LOGI("wifi_blocking_mod", "Setting the config active min to %ld", args[ARG_scan_time_active_min].u_int);
    scanning_config.scan_time.active.min = args[ARG_scan_time_active_min].u_int;
    ESP_LOGI("wifi_blocking_mod", "Setting the config passive time to %ld", args[ARG_scan_time_passive].u_int);
    scanning_config.scan_time.passive = args[ARG_scan_time_passive].u_int;
    
    ESP_LOGI("wifi_blocking_mod", "Replacing the current partial_scan_aps with an empty list");
    mp_state_ctx.vm.partial_scan_aps = mp_obj_new_list(0, NULL);

    // Set the scan_in_progress flag
    scan_in_progress = true;
    // Starting the inital scan
    MP_THREAD_GIL_EXIT();
    esp_err_t status = esp_wifi_scan_start(&scanning_config, blocking);
    MP_THREAD_GIL_ENTER();
    esp_exceptions(status);

