trwbox/micropython/ports/esp32/network_wlan.c
    // If this is a blocking request wait for the rest scan to complete, and therefore the rest of the channels to complete
    if(blocking) {
        ESP_LOGI("wifi_blocking_mod", "Waiting for scan_in_progress to change to false to unblock");
        if (scan_list){
            ESP_LOGI("wifi_blocking_mod", "There is more than 1 channel to scan, busy waiting for them to finish");
        }
        // Yield our thread in micropython to let another thread run if desired
        // This might not be the same effect as the blocking original, so this might need to be a busy wait?
        while(scan_in_progress){
            mp_event_wait_ms(1);
        }
        ESP_LOGI("wifi_blocking_mod", "scan_in_progress is done!");
        return mp_state_ctx.vm.last_scan_aps;
    // If this is non-blocking, just return None
    } else {
        ESP_LOGI("wifi_blocking_mod", "This should be running in the background, and be non-blocking");
        return mp_const_none;
    }
}
static MP_DEFINE_CONST_FUN_OBJ_KW(network_wlan_scan_non_blocking_obj, 1, network_wlan_non_blocking_scan);

static mp_obj_t network_wlan_isconnected(mp_obj_t self_in) {
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->if_id == ESP_IF_WIFI_STA) {
        return mp_obj_new_bool(wifi_sta_connected);
    } else {
        wifi_sta_list_t sta;
        esp_wifi_ap_get_sta_list(&sta);
        return mp_obj_new_bool(sta.num != 0);
    }
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_isconnected_obj, network_wlan_isconnected);

static mp_obj_t network_wlan_config(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    if (n_args != 1 && kwargs->used != 0) {
        mp_raise_TypeError(MP_ERROR_TEXT("either pos or kw args are allowed"));
    }

    wlan_if_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    bool is_wifi = self->if_id == ESP_IF_WIFI_AP || self->if_id == ESP_IF_WIFI_STA;

    wifi_config_t cfg;
    if (is_wifi) {
        esp_exceptions(esp_wifi_get_config(self->if_id, &cfg));
    }

    if (kwargs->used != 0) {
        if (!is_wifi) {
            goto unknown;
        }

        for (size_t i = 0; i < kwargs->alloc; i++) {
            if (mp_map_slot_is_filled(kwargs, i)) {
                int req_if = -1;

                switch (mp_obj_str_get_qstr(kwargs->table[i].key)) {
                    case MP_QSTR_mac: {
                        mp_buffer_info_t bufinfo;
                        mp_get_buffer_raise(kwargs->table[i].value, &bufinfo, MP_BUFFER_READ);
                        if (bufinfo.len != 6) {
                            mp_raise_ValueError(MP_ERROR_TEXT("invalid buffer length"));
                        }
                        esp_exceptions(esp_wifi_set_mac(self->if_id, bufinfo.buf));
                        break;
                    }
                    case MP_QSTR_ssid:
                    case MP_QSTR_essid: {
                        req_if = ESP_IF_WIFI_AP;
                        size_t len;
                        const char *s = mp_obj_str_get_data(kwargs->table[i].value, &len);
                        len = MIN(len, sizeof(cfg.ap.ssid));
                        memcpy(cfg.ap.ssid, s, len);
                        cfg.ap.ssid_len = len;
                        break;
                    }
                    case MP_QSTR_hidden: {
                        req_if = ESP_IF_WIFI_AP;
                        cfg.ap.ssid_hidden = mp_obj_is_true(kwargs->table[i].value);
                        break;
                    }
                    case MP_QSTR_security:
                    case MP_QSTR_authmode: {
                        req_if = ESP_IF_WIFI_AP;
                        cfg.ap.authmode = mp_obj_get_int(kwargs->table[i].value);
                        break;
                    }
                    case MP_QSTR_key:
                    case MP_QSTR_password: {
                        req_if = ESP_IF_WIFI_AP;
                        size_t len;
                        const char *s = mp_obj_str_get_data(kwargs->table[i].value, &len);
                        len = MIN(len, sizeof(cfg.ap.password) - 1);
                        memcpy(cfg.ap.password, s, len);
                        cfg.ap.password[len] = 0;
                        break;
                    }
                    case MP_QSTR_channel: {
                        uint8_t channel = mp_obj_get_int(kwargs->table[i].value);
                        if (self->if_id == ESP_IF_WIFI_AP) {
                            cfg.ap.channel = channel;
                        } else {
                            // This setting is only used to determine the
                            // starting channel for a scan, so it can result in
                            // slightly faster connection times.
                            cfg.sta.channel = channel;

                            // This additional code to directly set the channel
                            // on the STA interface is only relevant for ESP-NOW
                            // (when there is no STA connection attempt.)
                            uint8_t old_primary;
                            wifi_second_chan_t secondary;
                            // Get the current value of secondary
                            esp_exceptions(esp_wifi_get_channel(&old_primary, &secondary));
                            esp_err_t err = esp_wifi_set_channel(channel, secondary);
                            if (err == ESP_ERR_INVALID_ARG) {
                                // May need to swap secondary channel above to below or below to above
                                secondary = (
                                    (secondary == WIFI_SECOND_CHAN_ABOVE)
                                    ? WIFI_SECOND_CHAN_BELOW
                                    : (secondary == WIFI_SECOND_CHAN_BELOW)
                                    ? WIFI_SECOND_CHAN_ABOVE
                                    : WIFI_SECOND_CHAN_NONE);
                                err = esp_wifi_set_channel(channel, secondary);
                            }
                            esp_exceptions(err);
                            if (channel != old_primary) {
                                // Workaround the ESP-IDF Wi-Fi stack sometimes taking a moment to change channels
                                mp_hal_delay_ms(1);
                            }
                        }
                        break;
                    }
                    case MP_QSTR_hostname:
                    case MP_QSTR_dhcp_hostname: {
                        // TODO: Deprecated. Use network.hostname(name) instead.
                        mod_network_hostname(1, &kwargs->table[i].value);
                        break;
                    }
                    case MP_QSTR_max_clients: {
                        req_if = ESP_IF_WIFI_AP;
                        cfg.ap.max_connection = mp_obj_get_int(kwargs->table[i].value);
                        break;
                    }
                    case MP_QSTR_reconnects: {
                        int reconnects = mp_obj_get_int(kwargs->table[i].value);
                        req_if = ESP_IF_WIFI_STA;
                        // parameter reconnects == -1 means to retry forever.
                        // here means conf_wifi_sta_reconnects == 0 to retry forever.
                        conf_wifi_sta_reconnects = (reconnects == -1) ? 0 : reconnects + 1;
                        break;
                    }
                    case MP_QSTR_txpower: {
                        int8_t power = (mp_obj_get_float(kwargs->table[i].value) * 4);
                        esp_exceptions(esp_wifi_set_max_tx_power(power));
                        break;
                    }
                    case MP_QSTR_protocol: {
                        esp_exceptions(esp_wifi_set_protocol(self->if_id, mp_obj_get_int(kwargs->table[i].value)));
                        break;
                    }
                    case MP_QSTR_pm: {
                        esp_exceptions(esp_wifi_set_ps(mp_obj_get_int(kwargs->table[i].value)));
                        break;
                    }
                    default:
                        goto unknown;
                }

                // We post-check interface requirements to save on code size
                if (req_if >= 0) {
                    require_if(args[0], req_if);
                }
            }
        }

        esp_exceptions(esp_wifi_set_config(self->if_id, &cfg));

        return mp_const_none;
    }

    // Get config

    if (n_args != 2) {
        mp_raise_TypeError(MP_ERROR_TEXT("can query only one param"));
    }

